app/controllers/guestbook_controller.rb

  def create
    params[:guestbook][:ip_address] = request.remote_ip
    @guestbook = Guestbook.new params[:guestbook]

    if @guestbook.save
---
INSERT INTO "guestbooks" ("created_at", "title", "nickname", "updated_at", "content", "is_active", "ip_address") VALUES('2010-07-19 04:51:23', NULL, '測試測試', '2010-07-19 04:51:23', '測試測試測試測試測試測試測試測試測試測試測試測試