app/controllers/register_controller.rb

  def create

    # check available slot first
    if Register.is_avaliable?

      params[:register][:ip_address] = request.remote_ip
      @register = Register.new(params[:register])

      if @register.save
---
INSERT INTO "registers" ("ptt_id", "created_at", "nickname", "updated_at", "tel", "is_active", "email", "ip_address") VALUES('ddddd', '2010-07-19 07:18:35', 'eddie', '2010-07-19 07:18:35', 'dd', 't', 'aaa@aa.cc', '127.0.0.1')